cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'weaveworks/tap'

brew 'ansible'
brew 'asdf'
brew 'autoconf'
brew 'automake'
brew 'autossh'
brew 'aws-iam-authenticator'
brew 'aws-sam-cli'
brew 'awscli'
brew 'bash'
brew 'cmake'
brew 'consul'
brew 'coreutils'
brew 'curl'
brew 'dep'
brew 'dive'
brew 'doctl'
brew 'eksctl'
brew 'fargatecli'
brew 'ffmpeg'
brew 'gawk'
brew 'gdrive'
brew 'git'
brew 'git-crypt'
brew 'git-extras'
brew 'git-lfs'
brew 'git-secret'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'grc'
brew 'groovy'
brew 'helm'
brew 'hping'
brew 'httpie'
brew 'httrack'
brew 'hub'
brew 'irssi'
brew 'jenv'
brew 'jp2a'
brew 'jq'
brew 'jx'
brew 'kops'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'kubectx'
brew 'kustomize'
brew 'libcaca', args: ['with-imlib2']
brew 'libgcrypt'
brew 'libgit2'
brew 'libpng'
brew 'libxml2'
brew 'minikube'
brew 'mplayer'
brew 'ncdu'
brew 'ngrep'
brew 'nmap'
brew 'node'
brew 'openssl'
brew 'openvpn'
brew 'p7zip'
brew 'packer'
brew 'pandoc'
brew 'pyenv'
brew 'rbenv'
brew 'readline'
brew 'rpm2cpio'
brew 'ruby-build'
brew 's3cmd'
brew 'shellcheck'
brew 'skaffold'
brew 'sshuttle'
brew 'terraform-docs'
brew 'terminal-notifier'
brew 'tfenv'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'vault'
brew 'wget'
brew 'youtube-dl'
brew 'yq'

cask 'amazon-photos'
cask 'atom'
cask 'chef/chef/chefdk'
cask 'cyberduck'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'gimp'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'handbrake'
cask 'iterm2'
cask 'keepassxc'
cask 'marshallofsound-google-play-music-player'
cask 'openoffice'
cask 'slack'
cask 'skype'
cask 'standard-notes'
cask 'sublime-text'
cask 'tunnelblick'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'vscodium'
cask 'xquartz'
