cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'

### Primary
brew 'aichat'
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'curl'
brew 'docker'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-extras'
brew 'git-lfs'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'grc'
brew 'jq'
brew 'libgcrypt'
brew 'libxml2'
brew 'ncdu'
brew 'netcat'
brew 'nmap'
brew 'ollama'
brew 'openssl'
brew 'readline'
brew 'repomix'
brew 'sl'
brew 'terminal-notifier'
brew 'tmux'
brew 'tree'
brew 'uv'
brew 'wget'
brew 'yt-dlp'

### Apps
cask 'chatgpt'
cask 'claude'
# cask 'cursor'
# cask 'cyberduck'
cask 'firefox'
# cask 'gimp'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'keepassxc'
# cask 'kindle'
cask 'lulu'
cask 'postman'
brew 'obsidian'
# cask 'slack'
cask 'sublime-text'
# cask 'vagrant'
cask 'visual-studio-code'
cask 'vlc'
# brew 'wireshark'
# cask 'utm'

### Dev
# brew 'autoconf'
# brew 'automake'
# brew 'cmake'
# brew 'dep'
# brew 'go'
# brew 'node'
# brew 'pyenv'
# brew 'rust'

### AWS
# brew 'aws-iam-authenticator'
# brew 'awscli'
# brew 'eksctl'
# brew 'fargatecli'
# brew 's3cmd'

### Azure
# brew 'azure-cli'

### K8S
# brew 'helm'
# brew 'istioctl'
# brew 'kubectl'
# brew 'kustomize'
# cask 'lens'
# brew 'skaffold'
# brew 'stern'
# brew 'yq'

### Optional
# brew 'asdf'
# brew 'autossh'
# brew 'certbot'
# brew 'doctl'
# brew 'emacs'
# brew 'gawk'
# brew 'git-crypt'
# brew 'git-secret'
# brew 'gitleaks'
# brew 'hping'
# brew 'httpie'
# brew 'jenv'
# brew 'jmeter'
# brew 'libgit2'
# brew 'libpng'
# brew 'libtiff'
# brew 'little-cms2'
# brew 'openjdk'
# brew 'openvpn'
# brew 'ngrep'
# brew 'p7zip'
# brew 'rpm2cpio'
# brew 'shellcheck'
# brew 'trufflehog', link: false
# brew 'vault'
# brew 'v2ray'
# brew 'webp'

# tap 'hudochenkov/sshpass'
# brew 'hudochenkov/sshpass/sshpass'

### VS Code
vscode "alefragnani.bookmarks"
vscode "anthropic.claude-code"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "kevinrose.vsc-python-indent"
vscode "mhutchie.git-graph"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "redhat.vscode-yaml"
