cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

brew 'ansible'
brew 'autossh'
brew 'awscli'
brew 'bash'
brew 'coreutils'
brew 'curl'
brew 'doctl'
brew 'ffmpeg'
brew 'gawk'
brew 'gdrive'
brew 'git'
brew 'git-crypt'
brew 'git-extras'
brew 'git-secret'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'grc'
brew 'groovy'
brew 'hping'
brew 'httpie'
brew 'httrack'
brew 'hub'
brew 'jp2a'
brew 'jq'
brew 'kops'
brew 'kubernetes-helm'
brew 'libcaca', args: ['with-imlib2']
brew 'libgcrypt'
brew 'libgit2'
brew 'libpng'
brew 'libxml2'
brew 'kubectx'
brew 'ncdu'
brew 'ngrep'
brew 'nmap'
brew 'node'
brew 'openssl'
brew 'packer'
brew 'pandoc'
brew 'pyenv'
brew 'rbenv'
brew 'readline'
brew 'rpm2cpio'
brew 'ruby-build'
brew 's3cmd'
brew 'shellcheck'
brew 'skaffold'
brew 'sshuttle'
brew 'terraform-docs'
brew 'terminal-notifier'
brew 'terragrunt', force: true, conflicts_with: ['tfenv']
brew 'tfenv'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'

cask 'adium'
cask 'atom'
cask 'chef/chef/chefdk'
cask 'cyberduck'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'minikube'
cask 'slack'
cask 'sublime-text'
cask 'tunnelblick'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'xquartz'
